Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t
Serialization structure for Profile Item Enumerator

Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t.nMaterialItems
Number of the profile items in the enumerator.

Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t.aMaterialItemNames
Profile names list.

Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t.aMaterialItemTypes
Profile types list.